Tekla Open API Reference for Tekla Structures 2025
PreferredPlacingTypes.BaseLineWithArrowAtStartPointPlacingType Method
 The object is placed using the base line placing. The line is drawn and will have an arrow at the start point.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PreferredPlacingTypeBase BaseLineWithArrowAtStartPointPlacingType()
Public Shared Function BaseLineWithArrowAtStartPointPlacingType As PreferredPlacingTypeBase
Return Value
Type: PreferredPlacingTypeBase
A new base line with arrow at start point placing type instance.
See Also
Reference
PreferredPlacingTypes Class
Tekla.Structures.Drawing Namespace